quantummongolia/industrial-iot/esp32_firmware/ushg/src/main.cpp
  uint32_t energyRaw = 0;
  r.energyOk = withRetry(
      [&] { return mb.readU32LowFirst(slave, cfg::SPM33_REG_ENERGY, energyRaw); });
  if (r.energyOk) {
    // 40026 нь primary side kWh-ийг ×0.1-ээр өгдөг (5.1 хүснэгт)
    r.energyKWh = energyRaw * 0.1f;
  }

  return r;
}

// ── Компрессор удирдлага (Atlas Copco Q1CMCSTD) ────────────────────────
struct CompReading {
  bool errOk = false, tempOk = false, pressOk = false, statusOk = false;
  uint16_t errorCode = 0;  // 0 = алдаагүй
  float tempC = 0;         // °C  (mCEL ÷ 1000)
  float pressureBar = 0;   // bar (mBAR ÷ 1000)
  uint8_t status = 0;      // 1..12 (1=Shutdown … 9=On Load … 12=Stopping)
};

// Flow cycle — агшин зуурын утгууд (алдаа / температур / даралт / төлөв).
CompReading Comp_readFast(Modbus &mb) {
  CompReading r;

  uint16_t err = 0;
  r.errOk = withRetry([&] { return mb.readU16(cfg::COMP_SLAVE, cfg::COMP_REG_ERROR, err); });
  if (r.errOk) r.errorCode = err;
  delay(cfg::FRAME_GAP_MS);

  int32_t t = 0;
  r.tempOk = withRetry([&] { return mb.readS32BE(cfg::COMP_SLAVE, cfg::COMP_REG_TEMP, t); });
  if (r.tempOk) r.tempC = t / 1000.0f;  // mCEL → °C
  delay(cfg::FRAME_GAP_MS);

  int32_t p = 0;
  r.pressOk = withRetry([&] { return mb.readS32BE(cfg::COMP_SLAVE, cfg::COMP_REG_PRESS, p); });
  if (r.pressOk) r.pressureBar = p / 1000.0f;  // mBAR → bar
  delay(cfg::FRAME_GAP_MS);

  // Status — ном дээр "GetStatus = 3 data word, бүтэн блокоор асуух" гэснийг дагана.
  uint16_t stW[3] = {0, 0, 0};
  r.statusOk = withRetry([&] { return mb.readWords(cfg::COMP_SLAVE, cfg::COMP_REG_STATUS, 3, stW); });
  if (r.statusOk) {
    r.status = (uint8_t)(stW[0] >> 8);  // "1 data byte, MSB used" → эхний word-ийн дээд байт
    // DEBUG: 3 word-ийг бүтэн харуулна — аль нь status (1..12) болохыг батлахад.
    Serial.printf("[Comp] STATUS 3w: w0=0x%04X w1=0x%04X w2=0x%04X → status=%u\n",
                  stW[0], stW[1], stW[2], r.status);
  }
  return r;
}

// Totalizer cycle — нийт ажилласан цаг (удаан өөрчлөгддөг).
bool Comp_readHours(Modbus &mb, uint32_t &hoursOut) {
  return withRetry([&] { return mb.readU32BE(cfg::COMP_SLAVE, cfg::COMP_REG_HOURS, hoursOut); });
}

// ── Глобал ─────────────────────────────────────────────────────────────
Modbus modbus;
FirebaseData fbData;
FirebaseAuth fbAuth;
FirebaseConfig fbConfig;

bool firebaseReady = false;
unsigned long lastWifiCheck = 0;
unsigned long lastTotalizerReadTime = 0; // Сүүлд totalizer уншсан агшин (ms)
unsigned long lastHeapLogTime = 0;       // Сүүлд heap-н хэмжээг log хийсэн агшин

unsigned int consecutiveReadFails = 0;
unsigned int totalRecoveryAttempts = 0;

// Connectivity watchdog state — салгагдсан агшнаас хойш хэдий хугацаа өнгөрснийг
// хэмжинэ (0 = одоо холбоотой, асуудалгүй).
unsigned long wifiDownSince = 0;
unsigned long fbNotReadySince = 0;

unsigned long fbNextAllowedAt = 0;
unsigned int fbFailStreak = 0;

// Energy (totalizer) утга 1 минутад нэг л шинэчлэгдэх тул хооронд нь cache-д хадгална.
float cachedEm06EnergyKWh = 0.0f; bool cachedEm06EnergyValid = false;
float cachedEm07EnergyKWh = 0.0f; bool cachedEm07EnergyValid = false;
float cachedEm11EnergyKWh = 0.0f; bool cachedEm11EnergyValid = false;

// Компрессорын нийт цаг — totalizer циклд (1 мин) уншина, хооронд cache-лнэ.
uint32_t cachedCompHours = 0; bool cachedCompHoursValid = false;

void fbOnFailure() {
  fbFailStreak++;
  unsigned long backoff =
      2000UL * (1UL << min((unsigned int)8, fbFailStreak));
  if (backoff > 300000UL)
    backoff = 300000UL;
  fbNextAllowedAt = millis() + backoff;
  Serial.printf("[Firebase] Backoff %lus (fail streak %u)\n", backoff / 1000,
                fbFailStreak);
}

void fbOnSuccess() {
  if (fbFailStreak > 0)
    Serial.println("[Firebase] Recovered");
  fbFailStreak = 0;
  fbNextAllowedAt = 0;
}

bool fbCanUpload() { return (long)(millis() - fbNextAllowedAt) >= 0; }

void recoverModbusBus() {
  totalRecoveryAttempts++;
  Serial.printf("[Recovery] Attempt #%u after %u failed cycles\n",
                totalRecoveryAttempts, consecutiveReadFails);
  if (totalRecoveryAttempts >= cfg::MAX_RECOVERY_ATTEMPTS) {
    // Цэвэр reboot — while(true)+WDT panic нь S3/USB-CDC дээр backtrace-аа гацсан
    // USB порт руу хэвлэхийг оролдоод reboot хүртэл хүрдэггүй. esp_restart() нь
    // panic printer-ээр орохгүй тул заавал найдвартай сэргэнэ.
    Serial.println("[Recovery] Max attempts — clean ESP.restart()");
    Serial.flush();
    delay(100);
    ESP.restart();
  }
  modbus.recover();
  consecutiveReadFails = 0;
  Serial.println("[Recovery] RS485 bus re-initialized");
}

void onWifiEvent(WiFiEvent_t event) {
  switch (event) {
  case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
    Serial.println("[WiFi] Disconnected — attempting auto-reconnect");
    WiFi.reconnect();
    break;
  case ARDUINO_EVENT_WIFI_STA_GOT_IP:
    Serial.printf("[WiFi] Reconnected — IP: %s\n",
                  WiFi.localIP().toString().c_str());
    break;
  default:
    break;
  }
}

void wifiConnect() {
  if (WiFi.status() == WL_CONNECTED)
    return;

  Serial.printf("[WiFi] Connecting to network: %s", WIFI_SSID);
  WiFi.mode(WIFI_STA);
  WiFi.setAutoReconnect(true);
  WiFi.persistent(true);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  unsigned long start = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - start < 15000) {
    delay(500);
    Serial.print(".");
  }

  if (WiFi.status() == WL_CONNECTED) {
    Serial.printf("\n[WiFi] Connected — IP: %s\n",
                  WiFi.localIP().toString().c_str());
  } else {
    Serial.println("\n[WiFi] Connection failed — will retry later");
    WiFi.disconnect(true);
    delay(100);
    WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
  }
}

void firebaseInit() {
  fbConfig.api_key = FIREBASE_API_KEY;
  fbConfig.database_url = FIREBASE_DB_URL;
  fbAuth.user.email = FIREBASE_USER_EMAIL;
  fbAuth.user.password = FIREBASE_USER_PASS;
  fbConfig.token_status_callback = tokenStatusCallback;
  fbData.setBSSLBufferSize(2048, 2048);
  Firebase.begin(&fbConfig, &fbAuth);
  Firebase.reconnectNetwork(true);
  Serial.println("[Firebase] init — authenticating");
}

// ========================== DATA-LED LIVENESS FLIP =========================
// Сул зогссон сенсорын утга өөрчлөгдөхгүй бол Firebase-ийн .on("value")
// listener асдаггүй тул dashboard-ийн ногоон data-LED анивчдаггүй. Үүнийг
// засахын тулд утгыг 2 орноор бөөрөнхийлж, гацсан тохиолдолд 3 дахь орныг
// 0↔1 сэлгэнэ — dashboard 2 орон харуулдаг тул flag үл харагдана. Уншилт
// амжилттай болоход л дуудагдана тул үхсэн сенсор анивчихгүй, stale болно.
// ЗӨВХӨН жижиг утганд (power); totalizer/energy/currents-д ХЭРЭГЛЭХГҮЙ.
struct LiveState { float last2 = NAN; bool flip = false; };
static float liveValue(float v, LiveState &st) {
  float v2 = roundf(v * 100.0f) / 100.0f;
  st.flip = (v2 == st.last2) ? !st.flip : false;
  st.last2 = v2;
  return v2 + (st.flip ? 0.001f : 0.0f);
}
LiveState lvEm06, lvEm07, lvEm11, lvCompTemp, lvCompPress;

void setup() {
  Serial.begin(115200);
  delay(300);
  Serial.println("\n========= ushg IoT (S3-Zero) =========");

  led::begin();
  xTaskCreatePinnedToCore(ledTask, "ledTask", 2048, nullptr, 1, nullptr, 0);

  modbus.begin();

  // SPM33 CT primary утгыг боотлох үед 2 slave-ээс уншиж кэшилнэ — P (40011)-г
  // secondary→primary хөрвүүлэхэд хэрэглэнэ. Унших нь алдвал loop() cycle бүрт
  // амжилттай болтол дахин оролдоно.
  delay(100);
  const uint8_t spmSlaves[3] = {cfg::EM06_SLAVE, cfg::EM07_SLAVE, cfg::EM11_SLAVE};
  for (uint8_t s : spmSlaves) {
    Spm33_readCtPrimary(modbus, s);
    delay(cfg::FRAME_GAP_MS);
  }


