quantummongolia/industrial-iot/esp32_firmware/ushg/src/main.cpp
  WiFi.onEvent(onWifiEvent);
  wifiConnect();
  firebaseInit();

  esp_task_wdt_config_t wdtConfig = {.timeout_ms = cfg::WDT_TIMEOUT_S * 1000,
                                     .idle_core_mask = 0,
                                     .trigger_panic = true};
  esp_task_wdt_reconfigure(&wdtConfig);
  esp_task_wdt_add(NULL);

  // Supervisor watchdog task — setup дууссаны дараа эхлүүлнэ (setup-ийн блоклох
  // wifiConnect зэргийг false-restart болгохгүйн тулд). Core 0.
  xTaskCreatePinnedToCore(watchdogTask, "wdog", 2048, nullptr, 1, nullptr, 0);
  Serial.printf("[WDT] Watchdog started — %lu second timeout\n",
                (unsigned long)cfg::WDT_TIMEOUT_S);
}

void loop() {
  g_loopBeat++;           // supervisor task-д "loop ахиж байна" дохио
  esp_task_wdt_reset();
  unsigned long now = millis();

  // ── Long-running stability watchdog ────────────────────────────────
  // Heap fragmentation (Firebase TLS буфер г.м.) удаан ажиллах тусам
  // хуримтлагдаж тогтворгүй болгож болзошгүй. 5 минут тутамд heap-г log
  // хийнэ. Free heap босгоос (20KB) доош унавал эсвэл uptime 24 цаг хэтэрвэл
  // clean restart хийнэ.
  if (now - lastHeapLogTime >= cfg::HEAP_LOG_INTERVAL_MS) {
    lastHeapLogTime = now;
    Serial.printf("[Heap] Free: %u | Min ever: %u | Uptime: %lus\n",
                  ESP.getFreeHeap(), ESP.getMinFreeHeap(), now / 1000);
  }
  if (ESP.getFreeHeap() < cfg::MIN_FREE_HEAP_BYTES) {
    Serial.printf("[Stability] Free heap %u < %u — restarting\n",
                  ESP.getFreeHeap(), cfg::MIN_FREE_HEAP_BYTES);
    delay(200);
    ESP.restart();
  }
  if (now >= cfg::MAX_UPTIME_MS) {
    Serial.println("[Stability] Reached 24h uptime — scheduled restart");
    delay(200);
    ESP.restart();
  }

  // ---- Connectivity watchdog ----
  // WiFi эсвэл Firebase нь cfg::MAX_OFFLINE_MS-ээс удаан салгагдвал цэвэр reboot.
  // WiFi буцаж ирэхэд / сенсор сэргэхэд төхөөрөмж 'бүр мөсөн алга' болохгүй,
  // заавал өөрөө сэргэх баталгаа. Firebase.ready()-г цикл бүрт дуудах нь
  // token-refresh-ийг тасралтгүй ажиллуулж бас тустай.
  if (WiFi.status() == WL_CONNECTED) {
    wifiDownSince = 0;
  } else if (wifiDownSince == 0) {
    wifiDownSince = now;
  } else if (now - wifiDownSince >= cfg::MAX_OFFLINE_MS) {
    Serial.println("[Watchdog] WiFi offline too long — clean restart");
    Serial.flush();
    delay(200);
    ESP.restart();
  }

  if (WiFi.status() == WL_CONNECTED && !Firebase.ready()) {
    if (fbNotReadySince == 0) {
      fbNotReadySince = now;
    } else if (now - fbNotReadySince >= cfg::MAX_OFFLINE_MS) {
      Serial.println("[Watchdog] Firebase not ready too long — clean restart");
      Serial.flush();
      delay(200);
      ESP.restart();
    }
  } else {
    fbNotReadySince = 0;
  }

  if (WiFi.status() != WL_CONNECTED &&
      now - lastWifiCheck >= cfg::WIFI_RETRY_MS) {
    lastWifiCheck = now;
    Serial.println("[WiFi] retry — async reconnect");
    WiFi.reconnect();
  }

  static unsigned long lastPoll = 0;
  if (now - lastPoll < cfg::POLL_MS)
    return;
  lastPoll = now;

  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("[WiFi] not connected");
    led::setMode(led::SLOW_RED);
    return;
  }

  // Boot үед уншиж чадаагүй CT primary-уудыг дахин оролдох — нэг slave/cycle.
  {
    static const uint8_t spmSlaves[3] = {cfg::EM06_SLAVE, cfg::EM07_SLAVE, cfg::EM11_SLAVE};
    for (uint8_t s : spmSlaves) {
      if (!ctPrimaryKnown[s]) {
        Spm33_readCtPrimary(modbus, s);
        delay(cfg::FRAME_GAP_MS);
        break; // зөвхөн нэгийг л оролдоно
      }
    }
  }

  // Цикл бүрд flow-cycle (power) эсвэл totalizer-cycle (energy) гэсэн 2 төрлийн
  // нэг нь явна. RS485 bus-н ачааллыг бууруулж, energy-г тусад нь 1 минутын циклд
  // уншина. Boot-ийн дараа нэг удаа energy-г шууд уншиж cache-г бөглөнө.
  bool totalizerCycle = (lastTotalizerReadTime == 0) ||
                        (now - lastTotalizerReadTime >= cfg::TOTALIZER_INTERVAL_MS);

  Spm33Reading em06, em07, em11;
  CompReading comp;                       // flow cycle-д уншина
  uint32_t compHours = 0;                 // totalizer cycle-д уншина
  bool compHoursOk = false;

  if (totalizerCycle) {
    // ── Totalizer cycle: EM06 + EM07 + EM11 энерги + компрессорын нийт цаг
    lastTotalizerReadTime = now;
    Serial.println("[Cycle] Totalizer read (1 min interval)");

    em06 = Spm33_readEnergy(modbus, cfg::EM06_SLAVE);
    if (em06.energyOk) { cachedEm06EnergyKWh = em06.energyKWh; cachedEm06EnergyValid = true; }
    delay(cfg::FRAME_GAP_MS);

    em07 = Spm33_readEnergy(modbus, cfg::EM07_SLAVE);
    if (em07.energyOk) { cachedEm07EnergyKWh = em07.energyKWh; cachedEm07EnergyValid = true; }
    delay(cfg::FRAME_GAP_MS);

    em11 = Spm33_readEnergy(modbus, cfg::EM11_SLAVE);
    if (em11.energyOk) { cachedEm11EnergyKWh = em11.energyKWh; cachedEm11EnergyValid = true; }
    delay(cfg::FRAME_GAP_MS);

    compHoursOk = Comp_readHours(modbus, compHours);
    if (compHoursOk) { cachedCompHours = compHours; cachedCompHoursValid = true; }
    delay(cfg::FRAME_GAP_MS);

    Serial.printf("[Totalizer] EM06:%s EM07:%s EM11:%s CompHrs:%s\n",
                  em06.energyOk ? String(em06.energyKWh, 1).c_str() : "#",
                  em07.energyOk ? String(em07.energyKWh, 1).c_str() : "#",
                  em11.energyOk ? String(em11.energyKWh, 1).c_str() : "#",
                  compHoursOk ? String(compHours).c_str() : "#");
  } else {
    // ── Flow cycle: EM06 + EM07 + EM11 power + компрессорын төлөв/темп/даралт
    em06 = Spm33_readPower(modbus, cfg::EM06_SLAVE);
    delay(cfg::FRAME_GAP_MS);
    em07 = Spm33_readPower(modbus, cfg::EM07_SLAVE);
    delay(cfg::FRAME_GAP_MS);
    em11 = Spm33_readPower(modbus, cfg::EM11_SLAVE);
    delay(cfg::FRAME_GAP_MS);

    comp = Comp_readFast(modbus);
    delay(cfg::FRAME_GAP_MS);

    Serial.printf("[Flow] EM06:%s EM07:%s EM11:%s | Comp st:%s err:%s T:%s P:%s\n",
                  em06.powerOk ? String(em06.powerKW, 2).c_str() : "#",
                  em07.powerOk ? String(em07.powerKW, 2).c_str() : "#",
                  em11.powerOk ? String(em11.powerKW, 2).c_str() : "#",
                  comp.statusOk ? String(comp.status).c_str() : "#",
                  comp.errOk ? String(comp.errorCode).c_str() : "#",
                  comp.tempOk ? String(comp.tempC, 1).c_str() : "#",
                  comp.pressOk ? String(comp.pressureBar, 2).c_str() : "#");
  }

  // ── Алдаа escalate ──────────────────────────────────────────────
  bool anyOk = em06.powerOk || em06.energyOk || em07.powerOk || em07.energyOk ||
               em11.powerOk || em11.energyOk ||
               comp.errOk || comp.tempOk || comp.pressOk || comp.statusOk || compHoursOk;
  if (anyOk) {
    consecutiveReadFails = 0;
    totalRecoveryAttempts = 0;
  } else {
    consecutiveReadFails++;
    if (consecutiveReadFails >= cfg::MAX_CONSECUTIVE_FAILS)
      recoverModbusBus();
  }

  // ── Firebase upload — /energy_meters subtree-г жижиг updateNode-оор бичнэ.
  if (!fbCanUpload()) {
    led::setMode(led::SLOW_RED);
    return;
  }
  if (!Firebase.ready()) {
    led::setMode(led::SLOW_RED);
    return;
  }
  if (!firebaseReady) {
    firebaseReady = true;
    Serial.println("[Firebase] ready");
    ota::begin(&fbData);  // DEVICE_ID register + командын stream нээх
  }

  // ─ /energy_meters/{em06,em07} ──────────────────────────────────────
  // Flow cycle: power_kw (instantaneous)
  // Totalizer cycle: total_energy_kwh (cumulative)
  bool emOk = true;
  bool emAny = false;
  {
    FirebaseJson j;
    auto addEm = [&](const char *id, const Spm33Reading &r, LiveState &lv) {
      String base = String(id) + "/";
      if (totalizerCycle) {
        if (r.energyOk) {
          j.set((base + "total_energy_kwh").c_str(), r.energyKWh);
          emAny = true;
        }
      } else {
        if (r.powerOk) {
          j.set((base + "power_kw").c_str(), liveValue(r.powerKW, lv));
          emAny = true;
        }
      }
    };
    addEm("em06", em06, lvEm06);
    addEm("em07", em07, lvEm07);
    addEm("em11", em11, lvEm11);
    if (emAny) {
      emOk = Firebase.RTDB.updateNodeSilent(&fbData, "/energy_meters", &j);
      if (!emOk)
        Serial.printf("[Firebase] /energy_meters ERROR: %s\n",
                      fbData.errorReason().c_str());
    }
  }

  // ─ /ushg/compressor ────────────────────────────────────────────────
  // Flow cycle: error_code + temp_c + pressure_bar + status (агшин зуурын)
  // Totalizer cycle: total_hours (cumulative)
  bool compOk = true;
  bool compAny = false;
  {
    FirebaseJson jc;
    if (totalizerCycle) {
      if (compHoursOk) { jc.set("total_hours", (int)cachedCompHours); compAny = true; }
    } else {
      if (comp.errOk)    { jc.set("error_code", (int)comp.errorCode); compAny = true; }
      if (comp.tempOk)   { jc.set("temp_c", liveValue(comp.tempC, lvCompTemp)); compAny = true; }
      if (comp.pressOk)  { jc.set("pressure_bar", liveValue(comp.pressureBar, lvCompPress)); compAny = true; }
      if (comp.statusOk) { jc.set("status", (int)comp.status); compAny = true; }
    }
    if (compAny) {
      jc.set("last_updated", (int)(millis() / 1000));
      compOk = Firebase.RTDB.updateNodeSilent(&fbData, "/ushg/compressor", &jc);
      if (!compOk)
        Serial.printf("[Firebase] /ushg/compressor ERROR: %s\n",
                      fbData.errorReason().c_str());
    }
  }

  if (!emAny && !compAny) {
    led::setMode(led::SLOW_RED);
    return;
  }

  if (emOk && compOk) {
    Serial.println("[Firebase] Updated");
    fbOnSuccess();
    led::setMode(led::OFF);
    led::pulse();
  } else {
    fbOnFailure();
    led::setMode(led::SLOW_RED);
  }

  // OTA heartbeat + self-test gate (амжилттай upload бүрд +1)
  ota::loop(&fbData, emOk && compOk);
}
